## 🧾 Terraform Plan for `iam_permission_boundary`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam_permission_boundary_advanced.aws_iam_policy.permission_boundary will be created
  + resource "aws_iam_policy" "permission_boundary" {
      + arn         = (known after apply)
      + description = "Permission boundary for limited read/write on DynamoDB and S3"
      + id          = (known after apply)
      + name        = "advanced-boundary-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:123456789012:table/my-table",
                          + "arn:aws:s3:::project-data/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCenter"  = "security"
          + "Environment" = "prod"
          + "Project"     = "analytics"
        }
      + tags_all    = {
          + "CostCenter"  = "security"
          + "Environment" = "prod"
          + "Project"     = "analytics"
        }
    }

  # module.iam_permission_boundary_advanced.aws_iam_role_policy_attachment.boundary_attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "boundary_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "analytics-read-role"
    }

  # module.iam_permission_boundary_advanced.aws_iam_role_policy_attachment.boundary_attachment[1] will be created
  + resource "aws_iam_role_policy_attachment" "boundary_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "app-lambda-execution-role"
    }

  # module.iam_permission_boundary_basic.aws_iam_policy.permission_boundary will be created
  + resource "aws_iam_policy" "permission_boundary" {
      + arn         = (known after apply)
      + description = "Restrict actions to S3 list and read only"
      + id          = (known after apply)
      + name        = "basic-permission-boundary"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::example-bucket",
                          + "arn:aws:s3:::example-bucket/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "dev"
          + "Owner"       = "team-platform"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "Owner"       = "team-platform"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->